Repository: medamineriahi2023/CDM-FRONT
Catalog: src/locale/messages.*.xlf
Languages: fr

source: الجمهورية التونسية
fr: République Tunisienne

source: ادخل بريدك الالكتروني
fr: Entrez votre adresse email

source: اعد ضبط كلمه السر
fr: Réinitialiser le mot de passe

source: أدخل كلمة السر
fr: Entrer le mot de passe

source: هل نسيت كلمة المرور؟
fr: Mot de passe oublié?

source: تسجيل الدخول
fr: Se connecter

source: الإعداد و المتابعة
fr: Configuration & suivi

source: إدارة المخزون
fr: Gestion du stock

source: التسجيل
fr: Bureau d'ordre

source: مراقبة التنظيم
fr: Contrôle de règlements

source: إدارة المستخدمين
fr: Gestion des utilisateurs

source: إدارة الخدمات
fr: Gestion des services

source: تتبع العمل
fr: Suivi des actions

source: بحث
fr: Chercher

source: إدارة...
fr: Administration ...

source: المسؤل
fr: Responsable

source: السيدة أ
fr: Mme x

source: إلغاء
fr: Annuler

source: تحميل الخدمات
fr: Télécharger les services

source: تحميل المستخدمين
fr: Télécharger les utilisateurs

source: لتحميل الخدمات عليك إحترم القواعد التالية
fr: Pour télécharger les services, vous devez respecter les règles suivantes

source: يجب أن يكون الملف من نوع .csv
fr: Le fichier doit être de type .csv

source: يجب أن يحتوي السطر الأول على مفاتيح الخدمات
fr: La première ligne doit contenir les clés de service

source: يمكنك تنزيل واستخدام النموذج وملء الملف <a style="text-decoration: none ; cursor: pointer; outline: none" href="../../../../../../assets/file/file-services.csv" download="file-services.csv"><b>من هنا</b></a>
fr: Vous pouvez télécharger et utiliser le formulaire et remplir le dossier <a style="text-decoration: none ; cursor: pointer; outline: none" href="../../../../../../assets/file/file-services.csv" download="file-services.csv"><b>cliquer ici</b></a>

source: الرجاء الإنتظار...
fr: attendez , s'il vous plaît ...

source: الإسم و اللقب
fr: Nom et prenom

source: البريد الإلكتوني
fr: Email

source: كلمة السر
fr: Mot de passe

source: الخدمات
fr: Service

source: لتحميل المستخدمين عليك إحترم القواعد التالية
fr: Pour télécharger des utilisateurs, vous devez respecter les règles suivantes

source: يجب أن يحتوي السطر الأول على مفاتيح المستخدم
fr: La première ligne doit contenir les clés de l'utilisateur

source: يجب أن يكون إسم الخدمة بالضبط مثل المسجلة في قاعدة البيانات
fr: Le nom du service doit être exactement le même que celui de la base de données

source: المستخدمين <fa-icon *ngIf="sortby == 'fullname' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'fullname' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>
fr: Utilisateurs <fa-icon *ngIf="sortby == 'fullname' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'fullname' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>

source: البريد الالكتروني <fa-icon *ngIf="sortby == 'email' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'email' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>
fr: Email <fa-icon *ngIf="sortby == 'email' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'email' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>

source: الخدمات <fa-icon *ngIf="sortby == 'service' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'service' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>
fr: Service <fa-icon *ngIf="sortby == 'service' && sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'service' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>

source: الملف الشخصي <fa-icon *ngIf="sortby == 'role'&& sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'role' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>
fr: Profil <fa-icon *ngIf="sortby == 'role'&& sortType==true" style="cursor: pointer; margin-top: 10px" [icon]="faSortAsc"></fa-icon><fa-icon *ngIf="sortby == 'role' && sortType==false" style="cursor: pointer; margin-top: 10px" [icon]="faSortDesc"></fa-icon>

source: الإجراءات
fr: Actions

source: إسم الخدمة
fr: Nom du service

source: أجراءات
fr: Actions

source: المستخدمين
fr: Utilisateurs

source: التاريخ
fr: Dates

source: الساعة
fr: Heure

source: التفاصيل
fr: Détails

source: تفاصيل الخدمة <span> : <<{{historyToEdit?.action}}>></span>
fr: Détails action<span> : <<{{historyToEdit?.action}}>></span>

source: طالب الخدمة<span> : {{historyToEdit?.service?.serviceName}}</span>
fr: Demandeur service<span> : {{historyToEdit?.service?.serviceName}}</span>

source: المسؤل<span> : {{historyToEdit?.user?.firstname + " " + historyToEdit?.user?.lastname}}</span>
fr: Gestionnaire<span> : {{historyToEdit?.user?.firstname + " " + historyToEdit?.user?.lastname}}</span>

source: التاريخ و الساعة<span> : {{historyToEdit?.creationDate | date:'dd/MM/yyyy HH:mm'}}</span>
fr: Date et heure<span> : {{historyToEdit?.creationDate | date:'dd/MM/yyyy HH:mm'}}</span>

source: فتح المخزون
fr: Consulter Stock

source: طباعة
fr: Imprimer

source: الرجاء الإنتظار...
fr: attendez , s'il vous plaît ...
